// components/form/form.js
Component({
  /**
   * 组件的属性列表
   */
  properties: {

  },

  /**
   * 组件的初始数据
   */
  data: {
    formData: {
      firstRow: ["省份/直辖市", "GDP", "增长率", "排名"],
      firstColumn: ['广东', '河南', '河北', '广西', '湖北', '湖南', '浙江', '江西', '云南', '海南', '福建', '山东', '山西', '甘肃',],
      listRow: [
        { x: '广东', y: '72812456', z: '8.0%', g: "1" },
        { x: '河南', y: '37010', z: '8.35%', g: "3" },
        { x: '河北', y: '70116', z: '8.5%', g: "2" },
        { x: '广西', y: '70116', z: '8.5%', g: "2" },
        { x: '湖北', y: '70116', z: '8.5%', g: "2" },
        { x: '湖南', y: '70116', z: '8.5%', g: "2" },
        { x: '浙江', y: '70116', z: '8.5%', g: "2" },
        { x: '江西', y: '70116', z: '8.5%', g: "2" },
        { x: '云南', y: '70116', z: '8.5%', g: "2" },
        { x: '海南', y: '70116', z: '8.5%', g: "2" },
        { x: '福建', y: '70116', z: '8.5%', g: "2" },
        { x: '山东', y: '70116', z: '8.5%', g: "2" },
        { x: '山西', y: '70116', z: '8.5%', g: "2" },
        { x: '甘肃', y: '70116', z: '8.5%', g: "2" },
      ]
    }
  },

  /**
   * 组件的方法列表
   */
  methods: {

  }
})
